bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/sensor_service.c
  uint8_t uuid[16];

  COPY_CONFIG_SERVICE_UUID(uuid);
  ret = aci_gatt_add_serv(UUID_TYPE_128,  uuid, PRIMARY_SERVICE, 1+3,&ConfigServW2STHandle);

  if (ret != BLE_STATUS_SUCCESS) {
    goto fail;
  }

  COPY_CONFIG_W2ST_CHAR_UUID(uuid);
  ret =  aci_gatt_add_char(ConfigServW2STHandle, UUID_TYPE_128, uuid, 20 /* Max Dimension */,
                           CHAR_PROP_NOTIFY| CHAR_PROP_WRITE_WITHOUT_RESP,
                           ATTR_PERMISSION_NONE,
                           GATT_NOTIFY_ATTRIBUTE_WRITE | GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
                           16, 1, &ConfigCharHandle);

  if (ret != BLE_STATUS_SUCCESS) {
    goto fail;
  }

  return BLE_STATUS_SUCCESS;

fail:
  //PRINTF("Error while adding Configuration service.\n");
  return BLE_STATUS_ERROR;
}


/**
 * @brief  Add the Console service using a vendor specific profile
 * @param  None
 * @retval tBleStatus Status
 */
tBleStatus Add_ConsoleW2ST_Service(void)
{
  tBleStatus ret;

  uint8_t uuid[16];

  COPY_CONSOLE_SERVICE_UUID(uuid);
  ret = aci_gatt_add_serv(UUID_TYPE_128,  uuid, PRIMARY_SERVICE, 1 + (3 * 2), &ConsoleW2STHandle);

  if (ret != BLE_STATUS_SUCCESS) {
    goto fail;
  }

  COPY_TERM_CHAR_UUID(uuid);
  ret =  aci_gatt_add_char(ConsoleW2STHandle, UUID_TYPE_128, uuid, W2ST_CONSOLE_MAX_CHAR_LEN,
                           CHAR_PROP_NOTIFY| CHAR_PROP_WRITE_WITHOUT_RESP | CHAR_PROP_WRITE | CHAR_PROP_READ ,
                           ATTR_PERMISSION_NONE,
                           GATT_NOTIFY_ATTRIBUTE_WRITE | GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
                           16, 1, &TermCharHandle);

  if (ret != BLE_STATUS_SUCCESS) {
    goto fail;
  }

  COPY_STDERR_CHAR_UUID(uuid);
  ret =  aci_gatt_add_char(ConsoleW2STHandle, UUID_TYPE_128, uuid, W2ST_CONSOLE_MAX_CHAR_LEN,
                           CHAR_PROP_NOTIFY | CHAR_PROP_READ,
                           ATTR_PERMISSION_NONE,
                           GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
                           16, 1, &StdErrCharHandle);

  if (ret != BLE_STATUS_SUCCESS) {
     goto fail;
  }

  return BLE_STATUS_SUCCESS;

fail:
  //PRINTF("Error while adding Console service.\n");
  return BLE_STATUS_ERROR;
}

/**
 * @brief  Update Stderr characteristic value
 * @param  uint8_t *data string to write
 * @param  uint8_t lenght lengt of string to write
 * @retval tBleStatus      Status
 */
tBleStatus Stderr_Update(uint8_t *data,uint8_t length)
{
  tBleStatus ret;
  uint8_t Offset;
  uint8_t DataToSend;

  /* Split the code in packages*/
  ret = BLE_STATUS_SUCCESS;
  for (Offset = 0u; Offset < length; Offset += W2ST_CONSOLE_MAX_CHAR_LEN) {
    DataToSend = (length - Offset);
    DataToSend = (DataToSend > W2ST_CONSOLE_MAX_CHAR_LEN) ? W2ST_CONSOLE_MAX_CHAR_LEN : DataToSend;

    /* keep a copy */
    (void) memcpy(LastStderrBuffer, data + Offset, DataToSend);
    LastStderrLen = DataToSend;

    ret = aci_gatt_update_char_value(ConsoleW2STHandle, StdErrCharHandle, 0, DataToSend , data + Offset);
    if (ret != BLE_STATUS_SUCCESS) {
      ret = BLE_STATUS_ERROR;
    }
    HAL_Delay(10u);
  }

  return ret;
}


/**
 * @brief  Update Terminal characteristic value
 * @param  uint8_t *data string to write
 * @param  uint8_t lenght lengt of string to write
 * @retval tBleStatus      Status
 */
tBleStatus Term_Update(uint8_t *data,uint8_t length)
{
  tBleStatus ret;
  uint8_t Offset;
  uint8_t DataToSend;

  /* Split the code in packages */
  ret = BLE_STATUS_SUCCESS;
  for (Offset = 0u; Offset < length; Offset += W2ST_CONSOLE_MAX_CHAR_LEN) {
    DataToSend = (length - Offset);
    DataToSend = (DataToSend > W2ST_CONSOLE_MAX_CHAR_LEN) ? W2ST_CONSOLE_MAX_CHAR_LEN : DataToSend;

    /* keep a copy */
    (void) memcpy(LastTermBuffer, data + Offset, DataToSend);
    LastTermLen = DataToSend;

    ret = aci_gatt_update_char_value(ConsoleW2STHandle, TermCharHandle, 0, DataToSend, data + Offset);
    if (ret != BLE_STATUS_SUCCESS) {
        PRINTF("Error Updating Stdout Char\r\n");
      ret = BLE_STATUS_ERROR;
    }
    HAL_Delay(20u);
  }

  return ret;
}

/**
 * @brief  Update Stderr characteristic value after a read request
 * @param None
 * @retval tBleStatus      Status
 */
static tBleStatus Stderr_Update_AfterRead(void)
{
  tBleStatus ret;

  ret = aci_gatt_update_char_value(ConsoleW2STHandle, StdErrCharHandle, 0, LastStderrLen , LastStderrBuffer);
  if (ret != BLE_STATUS_SUCCESS) {
    ret = BLE_STATUS_ERROR;
  }

  return ret;
}

/**
 * @brief  Update Terminal characteristic value after a read request
 * @param None
 * @retval tBleStatus      Status
 */
static tBleStatus Term_Update_AfterRead(void)
{
  tBleStatus ret;

  ret = aci_gatt_update_char_value(ConsoleW2STHandle, TermCharHandle, 0u, LastTermLen , LastTermBuffer);
  if (ret != BLE_STATUS_SUCCESS) {
    if (0 != W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)) {
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating Stdout Char\r\n");
      (void) Stderr_Update(BufferToWrite, BytesToWrite);
    } else {
      PRINTF("Error Updating Stdout Char\r\n");
    }
    ret = BLE_STATUS_ERROR;
  }

  return ret;
}
/* @brief  Send a notification for answering to a configuration command for Accelerometer events
 * @param  uint32_t Feature Feature calibrated
 * @param  uint8_t Command Replay to this Command
 * @param  uint8_t data result to send back
 * @retval tBleStatus Status
 */
tBleStatus Config_Notify(uint32_t feature, uint8_t command, uint8_t data)
{
  tBleStatus ret;
  uint8_t buff[2 + 4 + 1 + 1];

  STORE_LE_16(buff, (HAL_GetTick() >> 3));
  STORE_BE_32(buff + 2, feature);
  buff[6] = command;
  buff[7] = data;

  ret = aci_gatt_update_char_value (ConfigServW2STHandle, ConfigCharHandle, 0u, 8u, buff);
  if (ret != BLE_STATUS_SUCCESS) {
    if (0 != W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)) {
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating Configuration Char\r\n");
      (void) Stderr_Update(BufferToWrite, BytesToWrite);
    } else {
      PRINTF("Error Updating Configuration Char\r\n");
    }
    ret = BLE_STATUS_ERROR;
  }
  return ret;
}

/**
 * @brief  Send a notification When the DS3 detects one Acceleration event
 * @param  Command to Send
 * @retval tBleStatus Status
 */
tBleStatus AccEvent_Notify(uint16_t Command)
{
  tBleStatus ret;
  uint8_t buff[2 + 2];

  STORE_LE_16(buff, (HAL_GetTick() >> 3));
  STORE_LE_16(buff + 2, Command);

  ret = aci_gatt_update_char_value(HWServW2STHandle, AccEventCharHandle, 0, 2 + 2, buff);
  if (ret != BLE_STATUS_SUCCESS) {
    if (0 != W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)) {
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating AccEvent_Notify Char\r\n");
      (void) Stderr_Update(BufferToWrite, BytesToWrite);
    } else {
      PRINTF("Error Updating AccEvent_Notify Char\r\n");
    }
    ret = BLE_STATUS_ERROR;
  }
  return ret;
}

/**
 * @brief  Add the HW Features service using a vendor specific profile
 * @param  None
 * @retval tBleStatus Status
 */
tBleStatus Add_HWServW2ST_Service(void)
{
  tBleStatus ret;
  int32_t NumberChars = 5;

