bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/sensor_service.c
    BytesToWrite = sprintf((char *)BufferToWrite,"Command:\r\n"
      "pr->HW pedometer reset\r\n"
       "info-> System Info\r\n"
#ifndef USE_STM32L0XX_NUCLEO
       "versionFw-> FW Version\r\n"
       "versionBle-> Ble Version\r\n");
#else /* USE_STM32L0XX_NUCLEO */
       );
#endif /* USE_STM32L0XX_NUCLEO */
       (void) Term_Update(BufferToWrite, BytesToWrite);
  } else if ((att_data[0] == 'p') && (att_data[1] == 'r')) {
    SendBackData = 0;
  }
#ifndef USE_STM32L0XX_NUCLEO
  else if (!strncmp("versionFw", (char *)(att_data), 9)) {
    BytesToWrite = sprintf((char *)BufferToWrite, "%s_%s_%c.%c.%c\r\n",
#ifdef STM32F401xC
                          "F401"
#elif STM32F446xx
                          "F446"
#elif STM32L476xx
                          "L476"
#else
#error "Undefined STM32 processor type"
#endif
                          ,DRN_PACKAGENAME,
                          DRN_VERSION_MAJOR,
                          DRN_VERSION_MINOR,
                          DRN_VERSION_PATCH);
    (void)Term_Update(BufferToWrite, BytesToWrite);
    SendBackData = 0;
  }
#endif /* USE_STM32L0XX_NUCLEO */
  else if(!strncmp("info", (char *)(att_data), 4)) {
    SendBackData = 0;
    
    BytesToWrite = sprintf((char *)BufferToWrite, "\r\nSTMicroelectronics %s:\r\n"
       "\tVersion %c.%c.%c\r\n"
#ifdef USE_STM32F4XX_NUCLEO
#ifdef STM32_NUCLEO
      "\tSTM32F401RE-Nucleo board"
#endif /* STM32_NUCLEO */
#elif USE_STM32L4XX_NUCLEO
#ifdef STM32_SENSORTILE
      "\tSTM32476RG-SensorTile board"
#elif STM32_NUCLEO
      "\tSTM32L476RG-Nucleo board"
#endif /* STM32_SENSORTILE */
#elif USE_STM32L0XX_NUCLEO
        "\tSTM32L053R8-Nucleo board"
#endif /* USE_STM32F4XX_NUCLEO */
        "\r\n",
        DRN_PACKAGENAME,
        DRN_VERSION_MAJOR, DRN_VERSION_MINOR, DRN_VERSION_PATCH);
    (void) Term_Update(BufferToWrite, BytesToWrite);

    BytesToWrite = sprintf((char *)BufferToWrite, "\t(HAL %ld.%ld.%ld_%ld)\r\n"
      "\tCompiled %s %s"
#if defined (__IAR_SYSTEMS_ICC__)
      " (IAR)\r\n",
#elif defined (__CC_ARM)
      " (KEIL)\r\n",
#elif defined (__GNUC__)
      " (openstm32)\r\n",
#endif
         HAL_GetHalVersion() >> 24,
        (HAL_GetHalVersion() >> 16) & 0xFF,
        (HAL_GetHalVersion() >> 8)  & 0xFF,
         HAL_GetHalVersion()        & 0xFF,
         __DATE__, __TIME__);
    (void) Term_Update(BufferToWrite, BytesToWrite);

#ifdef STM32_NUCLEO
  #ifdef USE_STM32L0XX_NUCLEO
    #ifdef IKS01A1
      BytesToWrite = sprintf((char *)BufferToWrite, "Code compiled for X-NUCLEO-IKS01A1\r\n");
    #elif IKS01A2
      BytesToWrite = sprintf((char *)BufferToWrite, "Code compiled for X-NUCLEO-IKS01A2\r\n");
    #endif /* IKS01A1 */
  #else /* USE_STM32L0XX_NUCLEO */  
    if(TargetBoardFeatures.SnsAltFunc) {
      BytesToWrite = sprintf((char *)BufferToWrite, "\tX-NUCLEO-IKS01A2 Board\r\n");
    } else {
      BytesToWrite = sprintf((char *)BufferToWrite, "\tX-NUCLEO-IKS01A1 Board\r\n");
    }
  #endif /* USE_STM32L0XX_NUCLEO */
  (void) Term_Update(BufferToWrite, BytesToWrite);
#endif /* STM32_NUCLEO */
  }
#ifndef USE_STM32L0XX_NUCLEO
  else if (!strncmp("upgradeFw", (char *)(att_data), 9)) {
    /* DO nothing, OTA function not integrated */
  } else if (!strncmp("versionBle", (char *)(att_data), 10)) {
    uint8_t  hwVersion;
    uint16_t fwVersion;
    /* get the BlueNRG HW and FW versions */
    (void) getBlueNRGVersion(&hwVersion, &fwVersion);
    BytesToWrite =sprintf((char *)BufferToWrite, "%s_%d.%d.%c\r\n",
                          (hwVersion > 0x30) ? "BleMS" : "Ble",
                          fwVersion >> 8,
                          (fwVersion >> 4) & 0xF,
                          (hwVersion > 0x30) ? (('a' + (fwVersion & 0xF)) - 1) : 'a');
    (void) Term_Update(BufferToWrite, BytesToWrite);
    SendBackData = 0;
  }
#endif /* USE_STM32L0XX_NUCLEO */
  else if ((att_data[0] == 'u') && (att_data[1] == 'i') && (att_data[2] == 'd')) {
    /* Write back the STM32 UID */
    uint8_t *uid = (uint8_t *)STM32_UUID;
    uint32_t MCU_ID = STM32_MCU_ID[0] & 0xFFFU;
    BytesToWrite = printf((char *)BufferToWrite, "%.2X%.2X%.2X%.2X%.2X%.2X%.2X%.2X%.2X%.2X%.2X%.2X_%.3lX\r\n",
                          uid[ 3], uid[ 2], uid[ 1], uid[ 0],
                          uid[ 7], uid[ 6], uid[ 5], uid[ 4],
                          uid[11], uid[10], uid[ 9], uid[ 8],
                          MCU_ID);
    (void) Term_Update(BufferToWrite, BytesToWrite);
    SendBackData = 0;
  } else {
  	// nothing to do - MISRAC2012-RULE_15_7-a
  }

#if 1
  /* If it's something not yet recognized... only for testing.. This must be removed */
  if (0 != SendBackData) {
    if (att_data[0] == '@') {
      if (att_data[1] == 'T') {
        uint8_t loc_att_data[8];
        uint8_t loc_data_length = 8;

        loc_att_data[0] = (FEATURE_MASK_TEMP1 >> 24) & 0xFF;
        loc_att_data[1] = (FEATURE_MASK_TEMP1 >> 16) & 0xFF;
        loc_att_data[2] = (FEATURE_MASK_TEMP1 >> 8 ) & 0xFF;
        loc_att_data[3] = (FEATURE_MASK_TEMP1    ) & 0xFF;
        loc_att_data[4] = 255;

        switch (att_data[2]) {
          case 'L':
            loc_att_data[5] = 50; /* @5S */
            break;
          case 'M':
            loc_att_data[5] = 10; /* @1S */
            break;
          case 'H':
            loc_att_data[5] = 1; /* @100mS */
            break;
          case 'D':
            loc_att_data[5] = 0; /* Default */
            break;
          default:
        	/* no action needed here */
        	break;
        }
        SendBackData = ConfigCommandParsing(loc_att_data, loc_data_length);
      } else if (att_data[1] == 'A') {
        uint8_t loc_att_data[8];
        uint8_t loc_data_length = 8;
        
        loc_att_data[0] = (FEATURE_MASK_ACC >> 24) & 0xFF;
        loc_att_data[1] = (FEATURE_MASK_ACC >> 16) & 0xFF;
        loc_att_data[2] = (FEATURE_MASK_ACC >> 8 ) & 0xFF;
        loc_att_data[3] = (FEATURE_MASK_ACC      ) & 0xFF;
        loc_att_data[4] = 255;

